soap using java 8/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://springsoapexample.com/soapexample">
    <soapenv:Header></soapenv:Header>
    <soapenv:Body>
        <us:UserRequest>
            <us:name>Sam</us:name>
        </us:UserRequest>
    </soapenv:Body>
</soapenv:Envelope>